var NEWS =[{
  id: 1,
  title: 'ЗАЯВЛЕНИЕ В КРЕМЛЕ ПО ЛУГАНСКУ, «ТОЛЬКО ТАК ВСЕ РЕШИТСЯ»: ПУТИН ОБЪЯСНИЛ ТРАМПУ ПО ДОНБАССУ – ХРОНИКА ДНР И ЛНР',
  autor: 'Елена БЫСТРОВА',
  text: "Донбасс, последние новости сегодня – 22 ноября." +
    "Глава российского государства Владимир Путин в ходе телефонных" +
    " переговоров с лидером США Дональдом Трампом обсудил процесс урегулирования ситуации в Донбассе. " +
    "Российский президент указал на единственный доступный метод разрешения конфликта на востоке Украины. " +
    "Об этом сообщает пресс-служба Кремля.По словам Владимира Путина, " +
    "единственным инструментом урегулирования конфликта в Донбассе является реализация Минска-2. " +
    "В Кремле уточнили,что при обсуждении украинского вопроса президент " +
    "России обратил внимание на безальтернативность исполнения Минских " +
    "соглашений от 2015 года.Читайте также: Ополчение заняло стратегическую " +
    "высоту в Донбассе – военкоры ЛНР, последние новости сегодня – 22 ноября. " +
    "В Кремле выступили с опровержением сообщений в прессе, которые якобы " +
    "поступили из окружения помощника президента РФ Владислава Суркова о " +
    "«поддержке определенных политических сил» в ЛНР. В Кремле отметили, " +
    "что даннаяинформация, озвученная в СМИ,не соответствует действительности." +
    "По словам Арутюнова, никакие источники, близкие к Суркову, такого заявить" +
    " не могли, поскольку ситуация в Луганске является внутренним делом ЛНР, " +
    "из Луганска за поддержкой в Кремль никто не обращался." +
    "Ранее одно из российских СМИ сообщило, ссылаясь на источник, близкий к " +
    "Суркову, что якобы Кремль занял позицию главы МВД ЛНР Игоря Корнета в " +
    "его конфликте с главой ЛНР Игорем Плотницким."

}, {
  id: 2,
  title: 'Джабраилова оштрафовали на полмиллиона рублей за стрельбу в отеле',
  autor: 'Евгений Биятов',
  text: 'МОСКВА, 22 ноя — РИА Новости. Тверской суд Москвы приговорил' +
    ' бывшего сенатора Умара Джабраилова к штрафу в пятьсот тысяч рублей' +
    ' за стрельбу в столичном отеле, передает корреспондент РИА Новости из зала суда. ' +
    'Дело рассматривалось в особом порядке, что предполагает полное' +
    ' признание вины и раскаяние подсудимого. Ему грозило не более двух ' +
    'третей от самого строгого наказания, предусмотренного соответствующей ' +
    'статьей (пять лет заключения).' +
    'Прокурор просил назначить Джабраилову два года лишения свободы условно. ' +
    'Сам экс-сенатор призвал учесть его "предыдущую жизнь" и ' +
    '"дела для Родины" и ограничиться штрафом.' +
    'В конце августа Джабраилов несколько раз выстрелил из наградного' +
    ' пистолета в потолок номера элитного отеля в центре Москвы. ' +
    'Бизнесмен объяснил свое поведение нервным срывом и состоянием аффекта, ' +
    'отметив, что он "человек контуженый" и воевал когда-то в Чечне.' +
    'Джабраилов в 2004-2009 годах был членом Совета Федерации от Чечни, ' +
    'входил в комитеты по экономической политике и международным делам. ' +
    'Сейчас предприниматель занимается строительством и возглавляет ' +
    'Российско-катарский деловой совет.'
}, {
  id: 3,
  title: '"Делись добром, Москва!" собрала рекордные 4 млн руб для детского хосписа',
  autor: 'Анна Жданова',
  text: 'МОСКВА, 22 ноя — РИА Новости. В Москве прошла третья ' +
    'благотворительная барахолка "Мода на благотворительность" проекта ' +
    '"Делись добром, Москва!". Все собранные за 8 часов средства были ' +
    'переданы в пользу неизлечимо больных детей — подопечных детского ' +
    'хосписа "Дом с маяком", которым требуется дорогостоящая медицинская ' +
    'техника для поддержания и улучшения качества жизни.' +
    'На этот раз была собрана рекордно большая сумма — 4 миллиона рублей.' +
    ' Не менее впечатляющим оказалось и количество посетителей открытого ' +
    'события — в течение одного дня принять участие в благотворительной ' +
    'барахолке пришли более 3000 человек!' +
    'Как сказала Лида Мониава, заместитель директора детского хосписа ' +
    '"Дом с маяком": "Мне до сих пор с трудом верится, что все это правда ' +
    'было и мне не приснилось. За один день удалось собрать больше ' +
    '4 миллионов рублей для детского хосписа! 50 партнеров, 120 волонтеров ' +
    'и 3000 гостей барахолки сделали что-то невероятное для детей хосписа. ' +
    'Спасибо огромное всем артистам, которые приняли участие в мероприятии ' +
    'и своим именем помогли нам привлечь гостей. Спасибо за коллекционные ' +
    'вещи для аукциона. Спасибо огромному количеству дизайнеров и ' +
    'магазинов одежды, которые совершенно бесплатно отдали для барахолки ' +
    'одежду, чтобы тем самым помочь собрать деньги на помощь неизлечимо ' +
    'больным детям. Спасибо всем, кто в это воскресенье приходил на ' +
    'благотворительную барахолку для детского хосписа!"' +
    'Организаторами события выступили Наталия Плохова, Ольга Савельева и ' +
    'Ксения Боломатова — работающая на волонтерских началах команда проекта' +
    ' "Делись добром, Москва!", созданного в ноябре 2016 года для поддержки' +
    ' благотворительных фондов и организаций.' +
    'На барахолке разместились корнеры одежды, обуви и аксессуаров' +
    ' известных брендов, а еще была устроена распродажа новых и винтажных ' +
    'предметов гардероба от частных лиц и звезд театра, музыкальной сцены,' +
    ' кино и спорта. В ходе мероприятия состоялось несколько этапов ' +
    'конкурса "Битва стилистов". Для моделей, которыми становились ' +
    'непосредственно гости мероприятия, профессиональные стилисты и ' +
    'дизайнеры создавали экспресс-образы из представленных на барахолке ' +
    'вещей. Созданные стилистами образы оценивало жюри, в состав которого' +
    ' вошли звезды кино и театра и эксперты модной индустрии: актриса ' +
    'Дарья Мельникова, актриса Дарья Повереннова, президент московской ' +
    'школы управления "Сколково" Андрей Шаронов, актриса Катерина Шпица,' +
    ' стилист и телеведущая Лина Дембикова, российская модель, журналист и ' +
    'галерист Полина Аскери, певица Саша Гридива, актер Андрей Гайдулян, ' +
    'актриса и певица Мириам Сехон, актер Владимир Фекленко, олимпийская ' +
    'чемпионка по художественной гимнастике Вера Шиманская и эксперт моды ' +
    'Дарья Куниловская.' +
    'Благотворительную барахолку "Мода на благотворительность", ведущими ' +
    'которой стали Елена Маркарян и Арсений Светлов, поддержали телеведущая' +
    ' Екатерина Стриженова с дочерью Александрой Стриженовой, актер' +
    ' Артур Смольянинов, актрисы Кристина Асмус, Анна Цуканова-Котт,' +
    ' Ксения Лукьянчикова, Екатерина Вуличенко, Серафима Низовская, ' +
    'Юлия Хлынина, Татьяна Лютаева, Агния Дитковските, Юлия Топольницкая, ' +
    'Аглая Тарасова, Любовь Новикова-Аксенова, Мария Шумакова, Яна Сексте, ' +
    'телеведущие Светлана Зейналова и Марина Ким.' +
    'Событие сопровождалось выступлением певицы Polina Ice и музыкальными' +
    ' сетами диджеев DJ Peretse, Маши Граниной, Дарьи Куниловской, а также' +
    ' сетами молодых диджеев школы DJ Грува — Юлии Бедулевой, ' +
    'Василия Боброва, Александра Бондарева, Сони Рублевой, Георгия Джура.' +
    'Впервые в рамках основного мероприятия была организована барахолка ' +
    'интерьеров "Много добра!": за первые же часы мероприятия посетителями' +
    ' было приобретено за благотворительные пожертвования более 200 ' +
    'предметов дизайна и интерьера, мебели и посуды.' +
    'Для всех посетителей третьей благотворительной барахолки ' +
    '"Мода на благотворительность" в течение дня работали студия красоты, ' +
    'экспресс чек-ап от медицинской клиники и центра восточной медицины, ' +
    'интерактивные развлекательные зоны от детского клуба и многое другое.' +
    'Все посетители мероприятия могли стать участниками благотворительного' +
    ' розыгрыша 300 призов.'
}, {
  id: 4,
  title: 'В Барнауле разыскивают «девочку с хомяком», подозреваемую в серии краж',
  autor: '',
  text: 'БАРНАУЛ, 16 ноя — РИА Новости. Сотрудники полиции Барнаула' +
    ' разыскивают женщину и девочку с хомяком, которые могут быть ' +
    'причастны к ряду квартирных краж, сообщает ГУ МВД по Алтайскому краю.' +
    'По данным ведомства, девочка представляется разными именами,' +
    ' знакомится на улице с ровесницами и предлагает посмотреть живого хомяка.' +
    '«После этого она предлагает взять животное себе в качестве питомца и ' +
    'под этим предлогом она попадает в квартиры. В ходе знакомства поясняет, ' +
    'что обучается в одной из школ города Барнаула. Находясь в доме, входит ' +
    'в доверие и просит остаться поиграть, совершая во время игры кражи. ' +
    'На улице девочка встречается с женщиной, после чего они вместе уходят ' +
    'в сторону одного из торговых центров», — говорится в сообщении.' +
    'В настоящий момент зарегистрированы два подобных факта, сотрудники ' +
    'полиции устанавливают личности девочки и женщины, подозреваемых в ' +
    'причастности к кражам.'
}];

var Article = React.createClass({
  render: function() {
      return (
        <li className = "newsEl" >
          <h1> {this.props.title} </h1>
          <div className = "text" > {this.props.text} </div>
          <h4 className = "autor" > {this.props.autor} </h4>
        </li>
      ) ;
  }
});

var NewsApp = React.createClass({
  getInitialState: function() {
    return {
        displayNews: NEWS
      };
  },

  render: function() {
    return (
      <div>
      <ul className = "NewList" >
        {
          this.state.displayNews.map(function(el) {
            return (
              <Article
            key = {el.id}
            title = {el.title}
            autor = {el.autor}
            text = {el.text}
            />
          );
        })

        }
      </ul>
    </div>
    );
  }
});

ReactDOM.render(
  <NewsApp /> ,
  document.getElementById("contents")
);
